COURSE_ACTS(COURSE_BOB, _(" 1 밥옴 전장"),
       _("정상의 킹 밥옴")               , _("잽싼 쿠파와 달리기 시합")      , _("하늘 섬으로 대포 발사"),
       _("빨간 코인 8개 찾기")           , _("날개 마리오로 하늘까지")       , _("쇠사슬 멍멍이 문 뒤"))

COURSE_ACTS(COURSE_WF, _(" 2 웜프 요새"),
       _("웜프의 몸통을 부숴라")          , _("요새 꼭대기로")                , _("푸른 하늘로 발사"),
       _("떠다니는 섬의 빨간 코인")       , _("우리에 갇힌 섬으로 낙하")      , _("벽을 날려버려라"))

COURSE_ACTS(COURSE_JRB, _(" 3 졸리 로저 만"),
       _("가라앉은 배의 보물")            , _("장어야 놀러 나올래?")          , _("바다 동굴의 보물"),
       _("떠 있는 배의 빨간 코인")        , _("돌기둥으로 발사")              , _("급류를 뚫고"))

COURSE_ACTS(COURSE_CCM, _(" 4 쿨쿨 마운틴"),
       _("미끄러지듯 내려가기")           , _("길 잃은 아기 펭귄")            , _("큰 펭귄과 경주"),
       _("눈썰매로 빨간 코인 8개")        , _("눈사람의 머리를 찾아라")       , _("삼각 점프면 된다"))

COURSE_ACTS(COURSE_BBH, _(" 5 빅부의 저택"),
       _("유령 사냥을 떠나자")            , _("빅부의 회전목마를 타라")       , _("유령 책의 비밀"),
       _("빨간 코인 8개를 찾아라")        , _("빅부의 발코니")                , _("비밀의 방에서 눈싸움"))

COURSE_ACTS(COURSE_HMC, _(" 6 안개 미로 동굴"),
       _("동굴을 헤엄치는 괴수")          , _("빨간 코인 8개로 승강")         , _("메탈 마리오, 움직여라!"),
       _("독안개 미로를 헤쳐라")          , _("아슬아슬 비상 탈출")           , _("굴러오는 바위를 조심"))

COURSE_ACTS(COURSE_LLL, _(" 7 용암 지대"),
       _("빅불리를 끓여버려라")           , _("불리들을 밀어내라")            , _("15조각 8코인 퍼즐"),
       _("뜨거운 통나무 굴리기")          , _("화산 속으로 뛰어들어라")       , _("화산 엘리베이터 관광"))

COURSE_ACTS(COURSE_SSL, _(" 8 사막 지대"),
       _("큰 새의 발톱 속에서")           , _("피라미드 꼭대기의 빛")         , _("고대 피라미드 속으로"),
       _("네 기둥 위에 우뚝 서라")        , _("빨간 코인 8개 자유 비행")      , _("피라미드 퍼즐"))

COURSE_ACTS(COURSE_DDD, _(" 9 깊고 깊은 항구"),
       _("쿠파의 잠수함에 올라라")        , _("물살 속의 보물상자")           , _("장대 점프로 빨간 코인"),
       _("급류를 뚫고")                   , _("만타가오리의 보답")            , _("모자들을 모아라..."))

COURSE_ACTS(COURSE_SL, _("10 눈사람 나라"),
       _("눈사람의 큰 머리")              , _("불리와 냉랭한 대결")           , _("꽁꽁 얼음 속으로"),
       _("얼어붙은 연못의 회오리")        , _("등껍질로 빨간 코인")           , _("이글루 속으로"))

COURSE_ACTS(COURSE_WDW, _("11 물마름 세계"),
       _("찌릿 화살 리프트!")             , _("마을 꼭대기")                  , _("얕은 물과 하늘의 비밀"),
       _("급행 엘리베이터 서둘러!")       , _("빨간 코인 찾아 마을로")        , _("번개처럼 시내 질주!"))

COURSE_ACTS(COURSE_TTM, _("12 높고 높은 산"),
       _("산을 올라라")                   , _("원숭이 우리의 수수께끼")       , _("무서운 버섯과 빨간 코인"),
       _("신비로운 산기슭")               , _("다리 위의 절경")               , _("외로운 버섯으로 발사"))

COURSE_ACTS(COURSE_THI, _("13 작고 큰 섬"),
       _("뻐끔플라워를 뽑아라")           , _("거대한 섬의 꼭대기")           , _("잽싼 쿠파와 재대결"),
       _("다섯 개의 작은 비밀")           , _("꿈틀이의 빨간 코인")           , _("꿈틀이를 몸부림치게"))

COURSE_ACTS(COURSE_TTC, _("14 째깍째깍 시계"),
       _("우리 속으로 굴러가라")          , _("구덩이와 진자")                , _("도움의 손길"),
       _("스톤을 밟아라")                 , _("움직이는 막대 위 타이밍 점프") , _("빨간 코인을 위해 시간 정지"))

COURSE_ACTS(COURSE_RR, _("15 무지개 라이드"),
       _("무지개를 건너는 유람선")        , _("하늘 위의 큰 집")              , _("미로 속에 쌓인 코인"),
       _("산들바람에 흔들흔들")           , _("까다로운 삼각형!")             , _("무지개 너머 어딘가"))

SECRET_STAR(COURSE_BITDW, _("   어둠 세계의 쿠파"))
SECRET_STAR(COURSE_BITFS, _("   불바다의 쿠파"))
SECRET_STAR(COURSE_BITS, _("   하늘의 쿠파"))
SECRET_STAR(COURSE_PSS, _("   공주님의 비밀 미끄럼틀"))
SECRET_STAR(COURSE_COTMC, _("   메탈 모자의 동굴"))
SECRET_STAR(COURSE_TOTWC, _("   날개 모자의 탑"))
SECRET_STAR(COURSE_VCUTM, _("   해자 밑의 투명 모자"))
SECRET_STAR(COURSE_WMOTR, _("   무지개 위 날개 마리오"))
SECRET_STAR(COURSE_SA, _("   비밀의 수족관"))
SECRET_STAR(COURSE_CAKE_END, _(""))

CASTLE_SECRET_STARS(_("   성의 비밀 별"))

EXTRA_TEXT(0, _("성의 비밀 별 중 하나!"))
EXTRA_TEXT(1, _(""))
EXTRA_TEXT(2, _(""))
EXTRA_TEXT(3, _(""))
EXTRA_TEXT(4, _(""))
EXTRA_TEXT(5, _(""))
EXTRA_TEXT(6, _(""))
